Repository: eldesh/coq_ja_work
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: *Limitations*
ja: *制限*

source: 1 is the default level.
ja: 1 はデフォルトレベルです。

source: 2 shows additional information such as tried tactics and shelving of goals.
ja: 2 は追加の情報を表示します。例えばタクティックやゴールの先送りなどです。

source: :ref:`functional-scheme` and :tacn:`function induction`
ja: :ref:`functional-scheme` と :tacn:`function induction`

source: A *caveat*, however, is that records cannot appear in mutually inductive (or co-inductive) definitions.
ja: 注意点として、しかしながら、レコードは相互帰納的 (または余帰納的) 定義の中に現れることはできません。

source: A *class* is either a sort (denoted by the keyword ``Sortclass``), a product type (denoted by the keyword ``Funclass``), or a type constructor (denoted by its name), e.g. an inductive type or any constant with a type of the form ``forall (`` |x_1| : |A_1| ) … ``(``\ |x_n| : |A_n|\ ``)``, `s` where `s` is a sort.
ja: *クラス* はソート (``Sortclass`` キーワードで表現される) か、積型 (``Funclass`` キーワードで表現される) か、または型構築子 (その名前で表現される) のいずれかであり、例えば、帰納型や ``forall (`` |x_1| : |A_1| ) … ``(``\ |x_n| : |A_n|\ ``)``, `s` ここで `s` はソートであるような形式の型を伴う任意の定数です。

source: A canonical structure is an instance of a record/structure type that can be used to solve unification problems involving a projection applied to an unknown structure instance (an implicit argument) and a value.
ja: 正準構造とはレコードまたはストラクチャ型のインスタンスの一つであり、それを未知のストラクチャインスタンス (暗黙引数) と値に射影を実行することで単一化問題を解くのに使うことが出来ます。

source: A commented version of sources of the |Coq| standard library (including only the specifications, the proofs are removed) is available at https://coq.inria.fr/stdlib/.
ja: |Coq| 標準ライブラリのコメント付きソースコード (仕様のみで、証明を省いたもの)は https://coq.inria.fr/stdlib/ で閲覧できます。

source: A companion volume to this reference manual, the |Coq| Tutorial, is aimed at gently introducing new users to developing proofs in |Coq| without assuming prior knowledge of type theory.
ja: このマニュアルと対を成す |Coq| チュートリアルは、新規ユーザが型理論の知識なしに |Coq| で証明を構築できるようになるまで、優しく導入することを目的としています。

source: A more precise description is given below.
ja: より詳細な説明を以下で与えます。

source: A text file `INSTALL` that comes with the sources explains how to install |Coq|.
ja: ソースに付属するテキストファイル `INSTALL` では、 |Coq| をインストールする方法について説明しています。

source: Addendum
ja: 付録

source: Additionally, user-written :g:`match` constructs on primitive records are desugared into substitution of the projections, they cannot be printed back as :g:`match` constructs.
ja: さらに、プリミティブレコード上のユーザ記述の :g:`match` は射影の代入への脱糖され、それらは :g:`match` として表示することは出来ません。

source: Adds blocks of implicit types with different specifications.
ja: 異なる仕様を伴った暗黙型のブロックを追加します。

source: Advanced recursive functions
ja: 高度な再帰関数

source: Again one has to tell |Coq| that the type ``nat`` is in the ``LEQ`` class, and how the type constructor ``*`` interacts with the ``LEQ`` class.
ja: この場合も |Coq| に ``nat`` 型が ``LEQ`` クラスに属していること、そして型コンストラクタ ``*`` が ``LEQ`` クラスとどのように相互作用するのかを伝える必要があります。

source: Again, for all the details the reader can refer to :cite:`CSwcu`.
ja: 繰り替えしますが、全ての詳細について :cite:`CSwcu` が読者の参考になります。

source: All in all, the only new piece of information we add in the ``LEQ`` class is the mixin, all the rest is already canonical for ``T`` and hence can be inferred by |Coq|.
ja: 結局のところ、我々が ``LEQ`` クラスに新たに追加した情報の断片は mixin だけであり、残りの全ては既に ``T`` について正準であり、従って |Coq| により推論することが出来ます。

source: All logical judgments in |Coq| are typing judgments.
ja: |Coq| における論理的判断は全て型付け判断です。

source: All services of the |Coq| proof assistant are accessible by interpretation of a command language called *the vernacular*.
ja: |Coq| が提供する全てのサービスは、 *Vernacular* と呼ばれるコマンド言語を読み込ませることで利用できます。

source: All variables are candidate for generalization if they appear free in the context under a generalization delimiter.
ja: 全ての変数は一般化デリミタの中の文脈で自由に出現するならば一般化の候補になります。

source: Allow generalization of the given identifiers only.
ja: 与えられた識別子のみについて一般化を許可します。

source: Allows exporting the choice of generalizable variables.
ja: 一般化可能変数についての選択をエクスポートします。

source: Alternatively, the following syntax allows creating objects by using named fields, as shown in this grammar.
ja: この文法で示されるように、代わりに以下の構文で名前付きフィールドを使うことでオブジェクトを作ることが出来ます。

source: An alternative syntax for projections based on a dot notation is available:
ja: 射影のためドット記法に基づいた代替構文が使用可能です:

source: An arbitrary context of ``binders`` can be put after the name of the instance and before the colon to declare a parameterized instance.
ja: パラメータ化されたインスタンスを宣言するためにインスタンスの名前の後かつコロンの前に ``binders`` の任意の文脈を置くことができます。

source: An example implementation is:
ja: 実装例は:

source: An optional priority can be declared, 0 being the highest priority as for :tacn:`auto` hints.
ja: 任意に優先度を宣言することが出来、:tacn:`auto` ヒントのためのもののように 0 が最高優先度です。

source: An unfolded primitive projection application obeys the rule above, while the folded version delta-reduces to the unfolded version.
ja: 非畳み込みプリミティブ射影適用は上の規則にしたがい、一方畳み込み版は非畳み込み版へデルタ簡約します。

source: And we enable |Coq| to relate pair of terms with ``<=``.
ja: そして |Coq| に項のペアを ``<=`` によって関連付けさせます。

source: Any argument not given as part of a typeclass binder will be automatically generalized.
ja: 型クラスの束縛子の一部として与えられなかった引数も自動的に一般化されます。

source: As before we register a canonical ``LE`` class for ``nat``.
ja: これまでのように ``nat`` のために正準 ``LE`` クラスを登録します。

source: As of Coq 8.6, ``all:once (typeclasses eauto)`` faithfully mimicks what happens during typeclass resolution when it is called during refinement/type inference, except that *only* declared class subgoals are considered at the start of resolution during type inference, while ``all`` can select non-class subgoals as well.
ja: Coq 8.6 を基点として、 ``all:once (typeclasses eauto)`` は宣言されたクラスサブゴール *だけ* が型推論中に解消の開始と考えられる場合を除き、精細化/型推論の間にそれが呼ばれたとき型クラス解決の間に何が起きるかを忠実に模倣し、一方 ``all`` は非クラスサブゴールを選択できる。

source: As we have seen, ``Ord`` is encoded as a record type with two parameters: a type ``A`` and an ``E`` of type ``EqDec A``.
ja: 見てきたように、``Ord`` は二つのパラメータ: ``A`` 型と ``EqDec A`` 型の ``E`` を持つレコードとして符号化されます。

source: Assume that :token:`qualid` denotes an object ``(Build_struct`` |c_1| … |c_n| ``)`` in the structure :g:`struct` of which the fields are |x_1|, …, |x_n|.
ja: :token:`qualid` がフィールドが |x_1|, …, |x_n| であるような構造 :g:`struct` の中のあるオブジェクト ``(Build_struct`` |c_1| … |c_n| ``)`` を示すと仮定します。

source: At the current stage we can use ``==`` and ``<=`` on concrete types, like tuples of natural numbers, but we can’t develop an algebraic theory over the types that are equipped with both relations.
ja: 現段階では我々は自然数の組のような具体型の上で ``==`` と ``<=`` を使うことができますが、両方の関係を備えた型上の代数的理論を開発することはできません。

source: Authors
ja: 著者

source: Automatic generation of induction schemes for non-recursive records defined with the ``Record`` keyword can be activated with the ``Nonrecursive Elimination Schemes`` option (see :ref:`proofschemes-induction-principles`).
ja: ``Record`` キーワードによって定義された非-再帰的レコードの帰納スキームの自動生成は ``Nonrecursive Elimination Schemes`` オプション (:ref:`proofschemes-induction-principles` 参照) によって有効化することができる。

source: Besides the :cmd:`Class` and :cmd:`Instance` vernacular commands, there are a few other commands related to typeclasses.
ja: :cmd:`Class` と :cmd:`Instance` Vernacular コマンドの他に、型クラスに関連するコマンドがいくつかあります。

source: Binding classes
ja: クラスの束縛

source: Building hierarchies
ja: 階層の構築

source: By default, all constants and local variables are considered transparent.
ja: デフォルトでは、全ての定数と局所変数は透明とみなされます。

source: By default, if no limit is given, the search is unbounded.
ja: デフォルトでは、制限が与えられないならば検索は制限されません。

source: Calling this command multiple times adds to the allowed identifiers.
ja: このコマンドの複数回呼ぶと許可された識別子へ追加します。

source: Canonical Structures
ja: 正準構造

source: Canonical structures
ja: 正準構造

source: Canonical structures are particularly useful when mixed with coercions and strict implicit arguments.
ja: 正準構造は型強制と厳密暗黙引数と混用したときに特に有用です。

source: Chapters :ref:`gallinaspecificationlanguage` and :ref:`extensionsofgallina` describe the concrete syntax as well as the meaning of programs, theorems and proofs in the Calculus of Inductive Constructions.
ja: :ref:`gallinaspecificationlanguage` および :ref:`extensionsofgallina` の章では、構文および Calculus of Inductive Constructions におけるプログラムや証明・定理の意味について説明します。

source: Chapter :ref:`calculusofinductiveconstructions` is a mathematical description of the formalism.
ja: :ref:`calculusofinductiveconstructions` の章は数学の形式的な説明です。

source: Chapter :ref:`thecoqlibrary` describes the standard library of |Coq|.
ja: :ref:`thecoqlibrary` の章では |Coq| の標準ライブラリについて説明します。

source: Chapter :ref:`themodulesystem` describes the module system.
ja: :ref:`themodulesystem` の章ではモジュールシステムについて説明します。

source: Chapter :ref:`vernacularcommands` presents all commands (we call them *vernacular commands*) that are not directly related to interactive proving: requests to the environment, complete or partial evaluation, loading and compiling files.
ja: :ref:`vernacularcommands` の章では、対話的証明と直接的には関係のないコマンド (*Vernacular コマンド*) を全て挙げます。コマンドは、環境への要求、完全/部分的な評価、ファイルの読み込みやコンパイルなどを行います。

source: Class and Instance declarations
ja: クラスとインスタンスの宣言

source: Coercions
ja: コアーション

source: Coercions and records in section :ref:`coercions-classes-as-records` of the chapter devoted to coercions.
ja: そのチャプターのセクション :ref:`coercions-classes-as-records` のコアーションとレコードはコアーションに費やされています。

source: Coercions can be used to implicitly inject terms from one *class* in which they reside into another one.
ja: コアーションは項をそれが属するある一つの *クラス* からもう一つのそれに暗黙的に埋め込むのに使うことが出来ます。

source: Coercions, implicit arguments, the type of pattern matching, but also notations (see :ref:`syntaxextensionsandinterpretationscopes`) can obfuscate the behavior of some tactics (typically the tactics applying to occurrences of subterms are sensitive to the implicit arguments).
ja: コアーション、暗黙引数、パターンマッチングの型、そればかりでなく表記法 (:ref:`syntaxextensionsandinterpretationscopes` 参照) もいくつかのタクティックの振る舞いを分かりにくくし得ます (典型的には部分項の出現に適用するタクティックは暗黙引数に対して敏感です)。

source: Compact declaration of Canonical Structures
ja: 正準構造のコンパクトな定義

source: Compatibility Projections and :g:`match`
ja: 互換性射影と :g:`match`

source: Contrary to :tacn:`auto`, introduction steps are counted, which might result in larger limits being necessary when searching with ``typeclasses eauto`` than with :tacn:`auto`.
ja: :tacn:`auto` と異なり、導入ステップは数えられ、その結果として :tacn:`auto` より ``typeclasses eauto`` による検索の時はより大きい制限が必要とされるかもしれません。

source: Contrary to :tacn:`eauto` and :tacn:`auto`, the resolution is done entirely in the new proof engine (as of Coq 8.6), meaning that backtracking is available among dependent subgoals, and shelving goals is supported.
ja: :tacn:`eauto` や :tacn:`auto` と逆に、(Coq 8.6 を基点として) 新しい証明エンジンの中で全体が完了します、依存サブゴールの中でバックトラッキングが可能で、かつゴールの見送りがサポートされていることを意味します。

source: Contrary to Haskell, we have no special syntax for superclasses, but this declaration is equivalent to:
ja: Haskell と違い、スーパークラスのために特別な構文はありませんが、この宣言は以下と等しくなります:

source: Controls whether typeclass resolution steps are shown during search.
ja: 型クラス解決のステップが検索中に表示されるかどうかを制御します。

source: Coq has an interactive mode in which commands are interpreted as the user types them in from the keyboard and a compiled mode where commands are processed from a file.
ja: Coq には、ユーザが入力した端からコマンドを実行していく対話モードと、ファイルに書かれたコマンドを順に実行していくコンパイルモードがあります。

source: Declares variables according to the given binding context, which might use :ref:`implicit-generalization`.
ja: 与えられた束縛コンテキストに従って変数を宣言します。それは :ref:`implicit-generalization` を使うかもしれません。

source: Defines a recursive function by well-founded recursion.
ja: 整礎再帰によって再帰関数を定義します。

source: Defines the not recursive function `ident` as if declared with `Definition`.
ja: 非-再帰関数 `ident` をあたかも `Definition` によって定義されたかのように定義します。

source: Defines the structural recursive function `ident` as if declared with ``Fixpoint``.
ja: 構造的再帰関数 `ident` を ``Fixpoint`` により定義されたかのように定義します。

source: Definitional classes are not wrapped inside records, and the trivial projection of an instance of such a class is convertible to the instance itself.
ja: 定義クラスはレコードの中に包まれておらず、そのようなクラスのインスタンスの自明な射影はそのインスタンスそれ自身と変換できます。

source: Dependent subgoals are automatically shelved, and shelved goals can remain after resolution ends (following the behavior of Coq 8.5).
ja: 依存サブゴールは自動的に先送りにされ、先送りされたゴールは (Coq 8.5 の振る舞いに従うと) 解消終了の後まで残ることがあります。

source: Depending on the ``{…}`` annotation, different definition mechanisms are used by ``Function``.
ja: ``{…}`` という注釈に依存して、``Function`` によって異なる定義機構が使われます。

source: Depending on the annotation, the user is left with some proof obligations that will be used to define the function.
ja: 注釈に依存して、その関数を定義するのに使われるいくらかの証明課題はユーザに残されます。

source: Derived Canonical Structures
ja: 派生した正準構造

source: Determines how much information is shown for typeclass resolution steps during search.
ja: どれくらいの情報が型クラス解決のステップが検索中に表示されるかを決定します。

source: Disable implicit generalization entirely.
ja: 暗黙の一般化を完全に無効にします。

source: During the definition of the one-constructor inductive definition, all the errors of inductive definitions, as described in Section :ref:`gallina-inductive-definitions`, may also occur.
ja: コンストラクタが一つの帰納的定義を定義しているとき、セクション :ref:`gallina-inductive-definitions` で説明される帰納的定義の全てのエラーも起こる可能性があります。

source: Each class definition gives rise to a corresponding record declaration and each instance is a regular definition whose name is given by ident and type is an instantiation of the record type.
ja: 各クラス定義は対応するレコード宣言を生みだし、各インスタンスは標準の定義でありその名前は ident で与えられ、その型はレコード型のインスタンス化です。

source: Error messages are also quite intelligible (if one skips to the end of the message).
ja: エラーメッセージも非常に理解しやすいです (メッセージの末尾まで飛ばすなら)。

source: Eta-conversion allows to define dependent elimination for these types as well.
ja: その上、Eta 変換はこれらの型について依存除去を定義することが出来ます。

source: Even if the record type has parameters, these do not appear at applications of the projection, considerably reducing the sizes of terms when manipulating parameterized records and type checking time.
ja: そのレコード型がパラメータを持っていたとしても、これらは射影の適用には現れず、パラメータ化されたレコードを操作するときの項のサイズや型検査時間を大幅に減少させます。

source: Examples of tactics are described in Chapter :ref:`detailedexamplesoftactics`.
ja: タクティックの具体例は :ref:`detailedexamplesoftactics` の章で説明します。

source: Extensions of |Gallina|
ja: |Gallina| の拡張

source: Finally, :token:`binders` are parameters of the record.
ja: 最後に、:token:`binders` はレコードのパラメータです。

source: Finally, Chapter :ref:`coqintegrateddevelopmentenvironment` describes CoqIDE.
ja: 最後に、 :ref:`coqintegrateddevelopmentenvironment` の章で、 CoqIDE について説明します。

source: Finally, the |SSR| proof language is presented in Chapter :ref:`thessreflectprooflanguage`.
ja: 最後に、証明言語 |SSR| について :ref:`thessreflectprooflanguage` の章で説明します。

source: First in Chapter :ref:`thecoqcommands`, the usage of `coqc` (batch mode) and `coqtop` (interactive mode) with their options is described.
ja: まず、 :ref:`thecoqcommands` の章で、`coqc` (コンパイルモード) と `coqtop` (対話モード) の使い方およびオプションについて説明します。

source: First the macro generates a variant type definition with just one constructor: :n:`Variant @ident {?
ja: まずマクロは高々一つのコンストラクタをもつバリアント型定義を生成します: :n:`Variant @ident { @binders } : @sort := @ident₀ { @binders }` 。

source: Following the previous example, one can write:
ja: 以前の例に続き、次のように書くことが出来ます。

source: For a given field :token:`ident`, its type is :g:`forall binders, type`.
ja: あるフィールド :token:`ident` が与えられた場合、その型は :g:`forall binders, type` です。

source: For an actual introduction to typeclasses, there is a description of the system :cite:`sozeau08` and the literature on type classes in Haskell which also applies.
ja: 実質的な型クラスの導入に付いてはシステムについての説明が :cite:`sozeau08` にあることに加え Haskell での型クラスについての論文も応用することが出来ます。

source: For compatibility, the parameters still appear to the user when printing terms even though they are absent in the actual AST manipulated by the kernel.
ja: 互換性のため、カーネルにより操作された実際のAST中には存在しないものであっても項を表示する時にパラメータはユーザに表示されます。

source: For each of them, the canonical structure of which it is a projection is indicated.
ja: それぞれについて、その正準構造が射影であるということを示しています。

source: For example it is better to define plus like this:
ja: 例えば plus はこのように定義した方が:

source: For example, forcing a constant to explicitely appear in the pattern will make it never apply on a goal where there is a hole in that place.
ja: 例えばある定数を、その場所にホールがあるゴール上でけっして適用させないパターン中に明示的に出現することを強制します。

source: For example:
ja: 例えば:

source: For instance, the above example gives the following output:
ja: 例えば、上の例は以下の出力を与えます。

source: For instance, we might have: :n:`Record @ident @binders : @sort := { @ident₁ : @type₁ ; @ident₂ := @term₂ ; @ident₃ : @type₃ }`.
ja: 例えば、:n:`Record @ident @binders : @sort := { @ident₁ : @type₁ ; @ident₂ := @term₂ ; @ident₃ : @type₃ }` があるとします。

source: For now, dependent cases are not treated for non structurally terminating functions.
ja: 今のところ、依存ケースは非-構造的停止関数として扱われません。

source: Function does not support partial application of the function being defined.
ja: Function は定義された関数の部分適用はサポートしません。

source: Further compatibility printing can be deactivated thanks to the ``Printing Primitive Projection Compatibility`` option which governs the printing of pattern matching over primitive records.
ja: さらなる互換表示は ``Printing Primitive Projection Compatibility`` オプションで非有効化することができ、これはプリミティブレコード上のパターンマッチを抑制します。

source: Hence the example can also be written:
ja: 従ってこの例は以下のようにも書くことが出来ます:

source: Here ``A`` is implicitly generalized, and the resulting function is equivalent to the one above.
ja: ここでは ``A`` は暗黙的に一般化され、結果の関数は上のそれに等しくなります。

source: Here is an example.
ja: これが例です。

source: Here the Global modifier redeclares the instance at the end of the section, once it has been generalized by the context variables it uses.
ja: ここで Global 修飾子はセクションの終わりで、かつてそれが使う文脈変数により一般化されていたインスタンスを再宣言します。

source: Here we show how to deal with type constructors, i.e. how to make the following example work:
ja: ここでは型コンストラクタをどのように扱うか、つまり以下の例がどのように動作するかを示します:

source: Hierarchy of structures
ja: 構造の階層

source: How to read this book
ja: この文書の読み方

source: How to start and stop proofs, do multiple proofs in parallel is explained in Chapter :ref:`proofhandling`.
ja: どのように証明を始め、終わればいいのか、どうすれば証明を並行して進めることができるかは、 :ref:`proofhandling` の章で説明しています。

source: However, one can still use it as if it had a single parameter inside generalizing binders: the generalization of superclasses will be done automatically.
ja: しかし、それでもそれを一般化束縛子の中で単一パラメータを持つかのように使うことができます: スーパークラスの一般化は自動的に行われます。

source: However, the generalizing binders should be used instead as they have particular support for typeclasses:
ja: しかしながら、替わりに型クラスの特別なサポートを持った束縛子の一般化を使うべきです。

source: However, this feature does not work for non structurally recursive functions.
ja: しかし、この帰納は非-構造的再帰関数については動きません。

source: However, to take the :math:`{\delta}` flag into account, projections can be in two states: folded or unfolded.
ja: しかし、:math:`{\delta}` フラグを考慮すると、射影は 畳み込み または 非畳み込み という二つの状態になり得ます。

source: If :token:`sort` is omitted, the default sort is `\Type`.
ja: :token:`sort` が省略された場合は、デフォルトのソートは `\Type` です。

source: If `string` ends in ``.dot`` or ``.gv``, the constraints are printed in the DOT language, and can be processed by Graphviz tools.
ja: `string` が ``.dot`` や ``.gv`` で終わっていたら、制約がDOT言語で出力され、Graphviz ツールで処理できるようになります。

source: If a field is named `_` then no projection is built for it.
ja: もしフィールドの名前が `_` ならばそれのための射影は構築されません。

source: If a same field occurs in several canonical structures, then only the structure declared first as canonical is considered.
ja: いくつかの正準構造に同じフィールドが現れた場合は、初めに定義された構造のみが正準と認められます。

source: If it is omitted, the default name ``Build_``\ :token:`ident`, where :token:`ident` is the record name, is used.
ja: それが省略された場合、デフォルトの名称である ``Build_``\ :token:`ident` ここで :token:`ident` はレコード名、が使われます。

source: If one does not give all the members in the Instance declaration, Coq enters the proof-mode and the user is asked to build inhabitants of the remaining fields, e.g.:
ja: インスタンス宣言の中で全てのメンバを与えない場合、Coq は証明モードに入りユーザが残りのフィールドの住民の構築を要求されます。例えば:

source: If set, use the record syntax (shown above) as the default display format.
ja: セットすると、レコード構文 (上記) をデフォルト表示形式として使用します。

source: If the optional ``Sorted`` option is given, each universe will be made equivalent to a numbered label reflecting its level (with a linear ordering) in the universe hierarchy.
ja: オプショナルな ``Sorted`` オプションが与えられると、各ユニバースは宇宙の階層内での (線形順序付けによる) レベルを反映した番号付きラベルに相当するようになります。

source: If the priority is not specified, it defaults to the number of non-dependent binders of the instance.
ja: 優先度が指定されないならば、デフォルトのそのインスタンスの非依存束縛子の数になります。

source: Implicit generalization
ja: 暗黙の一般化

source: Implicit generalization is an automatic elaboration of a statement with free variables into a closed statement where these variables are quantified explicitly.
ja: 暗黙の一般化とは自由変数を伴う式をこれらの変数が明示的に量化された閉じた文への自動的な詳細化です。

source: Implicit generalization is done inside binders starting with a \` and terms delimited by \`{ } and \`( ), always introducing maximally inserted implicit arguments for the generalized variables.
ja: 暗黙の一般化は \` から始まる束縛子と \`{ } と \`( ) で区切られている項の中で行われ、一般化された変数について常に最大限に暗黙引数が挿入されます。

source: Implicit types of variables
ja: 変数の暗黙の型

source: In Chapter :ref:`tactics`, all commands that realize one or more steps of the proof are presented: we call them *tactics*.
ja: :ref:`tactics` の章では、証明の1つまたは複数のステップを成すコマンド (*タクティック*) を全て挙げます。

source: In a Module Type, this command states that a corresponding concrete instance should exist in any implementation of this Module Type.
ja: このコマンドはあるモジュール型の中で、対応する具体的なインスタンスがこのモジュール型で何らかの実装として存在するべきだということを宣言します。

source: In a second step, the user can read also the tutorial on recursive types (document `RecTutorial.ps`).
ja: その後は、再帰型についてのチュートリアル (`RecTutorial.ps`) を読むのもいいでしょう。

source: In case no satisfying constraint can be found, an error is raised:
ja: 制約を充足するものが見つからない場合は、エラーが起きます:

source: In each case, `term` is the object projected and the other arguments are the parameters of the inductive type.
ja: いずれの場合も、`term` は射影されたオブジェクトであり、他の引数は帰納型のパラメータです。

source: In fact, the :cmd:`Record` macro is more general than the usual record types, since it allows also for “manifest” expressions.
ja: 実際は、:cmd:`Record` マクロは普通のレコード型より一般的であり、”マニフェスト” 式のためのものでもあります。

source: In interactive mode, users can develop their theories and proofs step by step, and query the system for available theorems and definitions.
ja: 対話モードでは、ユーザは順を追って証明を構築したり、利用できる定理や定義をシステムに問い合わせたりできます。

source: In other words |Coq| does not see that an object of the ``LEQ`` class is also an object of the ``LE`` class.
ja: 言い換えれば、|Coq| は ``LEQ`` クラスのオブジェクトが ``LE`` クラスのオブジェクトでもあるということが分かりません。

source: In our example:
ja: 我々の扱っている例では:

source: In particular it contains the requirement that the two relations we are combining are compatible.
ja: 特にそれは組み合わせた両立できる二つの要求を含んでいます。

source: In particular, it uses the implicit arguments mechanism if available, as shown in the example.
ja: 特に、例で示したように、それは可能であれば暗黙引数の機構を使います。

source: In some cases, to be able to specify sharing of structures, one may want to give explicitly the superclasses.
ja: 場合によっては、構造の共有を指定できるようにするため、スーパークラスを明示的に与えたいかもしれません。

source: In such cases, the context will probably contain some unexpected generalized variable.
ja: そのような場合、恐らく文脈にいくつかの意図しない一般化された変数が含まれています。

source: In the example above, ``A`` and ``eqa`` should be set maximally implicit.
ja: 上の例では、``A`` と ``eqa`` が最大限暗黙に設定されるはずです。

source: In the example above, a constraint ``EqDec A`` is generated and satisfied by ``eqa : EqDec A``.
ja: 上の例では、制約 ``EqDec A`` が生成され ``eqa : EqDec A`` によって充足されます。

source: In the expression:
ja: この式では:

source: In the following proofs are omitted for brevity.
ja: 以下の証明は簡潔さのため省略されています。

source: In the following statement for example, the variables n and m are automatically generalized and become explicit arguments of the lemma as we are using \`( ):
ja: 例えば以下の文では、\`( ) を使うことで変数 n と m は自動的に一般化され、そしてその補題の明示的引数になります。

source: In the following subsection we show how to make them more compact.
ja: 続く項ではそれらをどのようによりコンパクトにするかを示します。
